---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp
source: html/8956431a-7234-2923-094d-0a82f3097e05.htm
---
# Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp

The class contains the components of a legacy stair or ramp.

## Syntax (C#)
```csharp
public class IFCLegacyStairOrRamp : IDisposable
```